#include <iostream>

using namespace std;

void main_menu(){
	setlocale(LC_ALL, "Rus");
	cout << "-----------------------------------------------------------------\n";
	cout << "Карты\n";
	cout << "1. Перетасовать\n";
	cout << "2. Сортировать\n";
	cout << "3. Выход\n";
	cout << "-----------------------------------------------------------------\n";
	cout << "Выберите пункт меню : " << endl;
	int menu;
	cin >> menu;
	cout << "-----------------------------------------------------------------\n";
	while (menu != 3)
	{


		switch (menu)
		{
		case 1: //compressor();
			break;
		case 2: //decompressor();
		case 3: break;
		default:
			cout << "Error";

		}
		cout << "\n-----------------------------------------------------------------\n";
		cout << "Карты\n";
		cout << "1. Перетасовать\n";
		cout << "2. Сортировать\n";
		cout << "3. Выход\n";
		cout << "-----------------------------------------------------------------\n";
		cout << "Выберите пункт меню : " << endl;
		cin >> menu;
		cout << "-----------------------------------------------------------------\n";


	}
}